var mynameis = prompt("My name is: ");
alert("ชื่อของคุณคือ " + mynameis);
alert("วันนี้คือวันอะไร ?");
var day = prompt('วันนี้คือวัน ');
if (day === 'จันทร์') {
    alert('วันนี้เป็นวันจันทร์');
} else if (day === 'อังคาร') {
    alert('วันนี้เป็นวันอังคาร')
} else if (day === 'พุธ') {
    alert('วันนี้เป็นวันพุธ')
} else if (day === 'พฤหัสบดี') {
    alert('วันนี้เป็นวันพฤหัสบดี')
} else if (day === 'ศุกร์') {
    alert('วันนี้เป็นวันศุกร์')
} else if (day === 'เสาร์') {
    alert('วันนี้เป็นวันเสาร์')
} else if (day === 'อาทิตย์') {
    alert('วันนี้เป็นวันอาทิตย์')
} else {
    alert('ไม่พบวันที่ท่านระบุในระบบของวันที่พวกเราคุ้นเคย\nท่านต้องเป็นเอเลียนแน่ๆ');
}
